function scene(){ //start.html　が読み込まれた瞬間に来る
  setInterval(move,10);//ロゴの画像を大きくしていく関数を動かす
}

let width = 0;//start.html　にある logoの写真の横幅(%指定)
function move(){//ロゴの画像を大きくしていく関数
  width += 0.3;//10ミリ秒ごとに0.3増やす
  $('.logoImg').css('width',width + "%");
  if(width >= 100){
    location.href = 'index.html';
  }
}


//メニューアイコンの関数(ネットのコピペ)
//Don't touch!
document.addEventListener('DOMContentLoaded', function () {
  document.getElementById('menuButton').addEventListener('click', function (ev) {
    ev.preventDefault();
    this.classList.toggle('active');
  });
});

//メニューが表示されているかの処理
let menuDisplay = false;//メニューが表示されているか(初期値はfalse)

function menuClick(){//メニュー表示アイコンが押されたら動く
  menuDisplay = !menuDisplay;
  // console.log(menuDisplay);
  if(menuDisplay){//trueだったら...
    $('.menu').css('display','inline');//メニューを表示
  }else{//falseだったら...
    $('.menu').css('display','none');//メニューを非表示
  }
}


















//情報処理
//鎌倉の寺院データ
// Don't touch
//[名前,住所,年号,宗]の順番
//一次元配列はアイウエオ順
const data = [
  ['安国論寺','大町4-4-18','1253','日蓮宗'],
  ['安養院','大町3-1-22','1225','浄土宗'],
  ['雲頂庵','山ノ内479','1270-1300','臨済宗'],
  ['英勝寺','扇ガ谷1-46-3','1636','浄土宗'],
  ['荏原天神社','二階堂74','1104','神社'],
  ['延応寺','山ノ内1543','1250','臨済宗'],
  ['円覚寺','山ノ内409','1282','臨済宗'],
  ['永久寺','常磐611','1113-1118','日蓮宗'],
  ['円光寺','植木549','1558-1570','真言宗'],
  ['円命寺','材木座1-1-3','13世紀中頃','浄土宗'],
  ['黄梅院','山ノ内428','1354','臨済宗'],
  ['大船観音寺','岡本1-5-3','1981','曹洞宗'],
  ['回春院','山ノ内67','','臨済宗'],
  ['海蔵寺','扇ガ谷4-18-8','1253','臨済宗'],
  ['覚園寺','二階堂421','1218','真言宗'],
  ['鎌倉宮','二階堂154','1869','神社'],
  ['勧行寺','腰越2-19-15','1303','日蓮宗'],
  ['帰源院','山ノ内416','1378','臨済宗'],
  ['教恩寺','大町1-4-29','1678','時宗'],
  [' 玉泉寺','玉縄3-687','','真言宗'],
  ['久成寺','植木494','1520','日蓮宗'],
  ['九品寺','材木座5-13-14','1336','浄土宗'],
  ['葛原岡神社','梶原5-9-1','1887','神社'],
  ['啓運寺','材木座3-1-20','1483','日蓮宗'],
  ['顕証寺','七里ガ浜1-5-21','1947','本門仏立宗'],
  ['建長寺','山ノ内8','1253','臨済宗'],
  ['光照寺','山ノ内827','1859','時宗'],
  ['光触寺','十二所793','1278','時宗'],
  ['光則寺','長谷3-9-7','1274','日蓮宗'],
  ['高徳院','長谷4-2-28','不明','浄土宗'],
  ['向福寺','材木座3-15-13','1282','時宗'],
  ['光明寺','材木座6-17-19','不明','浄土宗'],
  ['極楽寺','極楽寺3-6-7','1259','真言律宗'],
  ['護国寺','扇ガ谷2-3-3','1969','日蓮正宗'],
  ['五社稲荷神社','岩瀬1399','1190-1199','神社'],
  ['小動神社','腰越2-9-12','1185-1189','神社'],
  ['御霊神社','坂ノ下3-17','平安時代後期','神社'],
  ['西念寺','岩瀬1527','1534','浄土宗'],
  ['佐助稲荷','佐助2-22','1190-1199','神社'],
  ['実相寺','材木座4-3-13','1284','日蓮宗'],
  ['収玄寺','長谷2-15-12','1818-1829','日蓮宗'],
  ['寿徳庵','山ノ内444','','臨済宗'],
  ['寿福寺','扇ガ谷1-17-7','1200','臨済宗'],
  ['常栄寺','大町1-12-11','1606','日蓮宗'],
  ['松久寺','浄明寺5-9-36','不明','曹洞宗'],
  ['上行寺','大町2-8-17','1313','日蓮宗'],
  ['浄光明寺','扇ガ谷2-12-1','1251','真言宗'],
  ['成就院','極楽寺1-1-5','1219','真言宗'],
  ['昌清院','山崎1482','','臨済宗'],
  ['浄泉寺','腰越2-10-15','819','真言宗'],
  ['浄智寺','山ノ内1402','1283','臨済宗'],
  ['正伝庵','山ノ内439','','臨済宗'],
  ['正統院','山ノ内92','','臨済宗'],
  ['成福寺','小袋谷2-13-33','1232','浄土真宗'],
  ['称名寺','小泉4-5-1','1175','浄土宗'],
  ['浄妙寺','浄明寺3-8-31','1188','臨済宗'],
  ['常楽寺','大船5-8-29','1237','臨済宗'],
  ['松嶺院','山ノ内453','','臨済宗'],
  ['青蓮寺','手広769','819','高野山真言宗'],
  ['瑞泉寺','二階堂710','1327','臨済宗'],
  ['杉本寺','二階堂903','734','天台宗'],
  ['禅居院','山ノ内1534','','臨済宗'],
  ['銭洗弁天','佐助2-25-16','1185','神社'],
  ['泉光寺','上町屋631','1668','真言宗'],
  ['千手院','材木座6-12-8','','浄土宗'],
  ['大巧寺','小町1-9-28','1274','仏教単立'],
  ['大慶寺','寺分1-5-8','1278-1287','臨済宗'],
  ['大長寺','岩瀬1464','1548','浄土宗'],
  ['大宝寺','大町3-6-22','1444','日蓮宗'],
  ['田代寺','大町3-1-22','1225','浄土宗'],
  ['多聞寺','大船2035','1469-1487','真言宗'],
  ['長寿寺','山ノ内1520','南北朝時代初期','臨済宗'],
  ['長勝寺','材木座2-12-17','1253','日蓮宗'],
  ['鶴岡八幡宮','雪ノ下2-1-31','1063','神社'],
  ['貞宗寺','植木656','1611','浄土宗'],
  ['天源院','山ノ内85','','臨済宗'],
  ['等覚寺','梶原1-9-2','1573-1592','高野山真言宗'],
  ['東慶寺','山ノ内1367','1285','臨済宗'],
  ['東漸寺','腰越2-22-13','1325','臨済宗'],
  ['長谷寺','長谷3-11-2','736','仏教単立'],
  ['白雲庵','山ノ内462','1282','臨済宗'],
  ['蛭子神社','小町2-23-3','1192?','神社'],
  ['補蛇落寺','材木座6-7-31','1181','真言宗'],
  ['仏行寺','笛田1055','1495','日蓮宗'],
  ['仏日庵','山ノ内434','','臨済宗'],
  ['富陽庵','山ノ内458','1416','臨済宗'],
  ['別願寺','大町1-11-4','1282','時宗'],
  ['宝戒寺','小町3-5-22','1335','天台宗'],
  ['法源寺','腰越5-1-17','1318','日蓮宗'],
  ['報国寺','浄明寺2-7-4','1334','臨済宗'],
  ['宝珠院','山ノ内104','','臨済宗'],
  ['宝善院','腰越5-13-17','','真言宗'],
  ['本覚寺','小町1-12-12','1436','日蓮宗'],
  ['本行寺','腰越3-25-19','1505','日蓮宗'],
  ['本興寺','大町2-5-32','1336','日蓮宗'],
  ['本成寺','腰越2-19-9','1309','日蓮宗'],
  ['本龍寺','腰越2-26-2','1302','日蓮宗'],
  ['満福寺','腰越2-4-8','744','真言宗'],
  ['明王院','十二所32','1231','真言宗'],
  ['妙高院','山ノ内9','','臨済宗'],
  ['妙長寺','材木座2-7-41','1299','日蓮宗'],
  ['妙典寺','腰越2-20-5','1260','日蓮宗'],
  ['妙伝寺','扇ガ谷2-21-3','1652','日蓮宗'],
  ['妙法寺','山崎663','1928','日蓮宗'],
  ['妙法寺','大町4-7-4','1253','日蓮宗'],
  ['妙本寺','大町1-15-1','1260','日蓮宗'],
  ['妙隆寺','小町2-17-20','1385','日蓮宗'],
  ['明月院','山ノ内189','1394','臨済宗'],
  ['黙仙寺','岡本1-4-1','1909','曹洞宗'],
  ['薬王寺','扇ガ谷3-5-1','1293','日蓮宗'],
  ['八雲神社','大町1-11-22','1081-1083','神社'],
  ['来迎寺','西御門1-11-1','1293','時宗'],
  ['来迎寺','材木座2-9-19','1194','時宗'],
  ['瀧口明神社','腰越1548-4','538','神社'],
  ['龍峰院','山ノ内101','','臨済宗'],
  ['竜宝寺','植木129','1503','時宗'],
  ['霊光寺','七里ガ浜1-14-5','明治時代末','日蓮宗'],
  ['蓮乗院','材木座6-16-15','','浄土宗'],
];//必ずconst!!









//
$(function () {
  searchWord = function(){
    var searchResult,
        searchText = $(this).val(), // 検索ボックスに入力された値
        targetText,
        hitNum;

    // 検索結果を格納するための配列を用意
    searchResult = [];

    // 検索結果エリアの表示を空にする
    $('#search-result__list').empty();
    $('.search-result__hit-num').empty();

    // 検索ボックスに値が入ってる場合
    if (searchText != '') {
      $('.target-area li').each(function() {
        targetText = $(this).text();

        // 検索対象となるリストに入力された文字列が存在するかどうかを判断
        if (targetText.indexOf(searchText) != -1) {
          // 存在する場合はそのリストのテキストを用意した配列に格納
          searchResult.push(targetText);
        }
      });

      // 検索結果をページに出力
      for (var i = 0; i < searchResult.length; i ++) {
        $('<span>').text(searchResult[i]).appendTo('#search-result__list');
      }

      // ヒットの件数をページに出力
      hitNum = '<span>検索結果</span>：' + searchResult.length + '件見つかりました。';
      $('.search-result__hit-num').append(hitNum);
    }
  };

  // searchWordの実行
  $('#search-text').on('input', searchWord);
});
